
{
    "settings_title": "Settings",
    "settings_description": "Manage your application settings, preferences, and account.",
    "appearance_title": "Appearance",
    "appearance_description": "Customize the look and feel.",
    "theme_label": "Theme",
    "language_label": "Language",
    "security_title": "Security",
    "security_description": "Manage additional security features.",
    "app_lock_label": "App Lock",
    "app_lock_description": "Require password on app launch.",
    "email_notifications_label": "Email Notifications",
    "email_notifications_description": "Receive important account updates.",
    "data_sync_title": "Data & Sync",
    "data_sync_description": "Manage your local application data.",
    "manual_sync_button": "Manual Sync",
    "delete_data_button": "Delete All Local Data",
    "delete_data_alert_title": "Are you absolutely sure?",
    "delete_data_alert_description": "This action cannot be undone. This will permanently delete all local data from your device. Data on the server will not be affected.",
    "cancel": "Cancel",
    "delete_data_alert_confirm": "Yes, delete everything",
    "last_synced_label": "Last synced:",
    "never": "Never",
    "language_updated": "Language Updated",
    "language_switched_to": "Switched to",
    "app_lock_enabled_title": "App Lock Enabled",
    "app_lock_enabled_desc": "Your password will be required on next launch.",
    "app_lock_disabled_title": "App Lock Disabled",
    "app_lock_disabled_desc": "The app will no longer be locked.",
    "syncing_data_title": "Syncing Data...",
    "syncing_data_desc": "Forcing a sync with the server. Please wait.",
    "sync_complete_title": "Sync Complete",
    "sync_complete_desc": "Your local data is now up-to-date.",
    "sync_failed_title": "Sync Failed",
    "sync_failed_desc": "Could not complete the sync. Please check your connection.",
    "data_cleared_title": "Local Data Cleared",
    "data_cleared_desc": "App will now reload with fresh data from the server.",
    "data_clear_error_desc": "Could not clear local data. Please try again.",

    "dashboard_title": "Dashboard",
    "projects_title": "Projects",
    "projects_description": "Manage your film projects. Create new projects, or use the menu on each card to view, edit, or delete existing ones.",
    "attendance_title": "Attendance",
    "team_title": "Team",
    "reports_title": "Reports",
    "profile_title": "Profile",
    "masters_title": "Masters",
    "payments_title": "Payments",
    "payments_description": "Manage crew payments on a per-project basis.",
    "masters_description": "Manage central lists for DOPs, Gaffers, and Designations.",
    "attendance_description": "Select a project and crew member to view their attendance calendar.",
    "team_description": "Manage your crew members. Add new members, edit or view their profiles.",
    "profile_description": "Manage your personal information and password.",
    "reports_description": "Generate and export detailed project, crew, and attendance reports.",
    
    "about_title": "About Us",
    "about_description": "The ultimate tool for film and production crew management.",
    "our_mission_title": "Our Mission",
    "our_mission_content": "At Light Crew, our mission is to streamline the complexities of film production management. We believe that by providing a powerful, intuitive, and accessible platform, we can empower creators, managers, and crew members to focus on what they do best: creating amazing visual stories. We aim to eliminate administrative bottlenecks, improve communication, and bring transparency to every stage of the production lifecycle.",
    "our_vision_title": "Our Vision",
    "our_vision_content": "We envision a future where production management is no longer a source of stress but a seamless part of the creative process. Light Crew will be the industry-standard tool, known for its reliability, offline-first capabilities, and user-centric design. We are committed to continuous innovation, ensuring our platform evolves with the dynamic needs of the film and media industry.",
    "key_features_title": "Key Features",
    "feature_pm_title": "Project Management",
    "feature_pm_desc": "Effortlessly create, track, and manage all your projects from a single dashboard.",
    "feature_crew_title": "Crew & Attendance",
    "feature_crew_desc": "Maintain detailed crew profiles and track attendance with our intuitive calendar system.",
    "feature_offline_title": "Offline First",
    "feature_offline_desc": "Work confidently on set, even without an internet connection. Your data syncs automatically.",

    "contact_title": "Contact Us",
    "contact_description": "We'd love to hear from you. Reach out with any questions or feedback.",
    "get_in_touch_title": "Get in Touch",
    "get_in_touch_desc": "Our team is available to assist you with any inquiries you may have.",
    "email_label": "Email",
    "email_desc": "For general inquiries, support, and feedback.",
    "address_label": "Address",
    "address_desc": "Our main office location.",

    "manual_title": "User Manual",
    "manual_description": "A complete guide to using the Light Crew application.",
    "manual_getting_started_title": "Getting Started",
    "manual_getting_started_desc": "Welcome to Light Crew! This guide will walk you through the essential features and workflows to get the most out of the application.",
    "manual_dashboard_title": "1. The Dashboard: Your Command Center",
    "manual_dashboard_desc": "The Dashboard is the first page you see after logging in. It provides a personalized, at-a-glance overview of your financial activity. You can filter your earnings, shifts, and payment status by month, year, or specific projects. This is where you can track your total earnings, paid amounts, and outstanding balance for any given period.",
    "manual_masters_title": "2. Managing Masters: The Foundation",
    "manual_masters_desc_p1": "Before you can effectively manage projects, you need to set up your master lists. Navigate to the Masters page from the sidebar. Here you can:",
    "manual_masters_dop_gaffer_title": "Add DOPs & Gaffers:",
    "manual_masters_dop_gaffer_desc": "Create profiles for your main Directors of Photography and Gaffers.",
    "manual_masters_designations_title": "Manage Designations:",
    "manual_masters_designations_desc": "Add all possible crew roles (e.g., Spark, Grip, Asst. Cameraman) to this list. This list will be used when adding new crew roles.",
    "manual_masters_desc_p2": "Keeping these lists updated is key to a smooth workflow.",
    "manual_projects_title": "3. Creating and Managing Projects",
    "manual_projects_desc": "Go to the Projects page. Click 'Add Project' to create a new entry. Fill in details like the client name, dates, and locations. The most important step here is assigning your crew. You can select multiple crew members and define their specific designation and daily wage for this project.",
    "manual_team_title": "4. Adding and Managing Team Roles",
    "manual_team_desc": "The Team page is where you manage individual crew roles. It's important to understand that each entry here represents a person in a specific role. A single person can have multiple entries if they work in different roles (e.g., John Doe as Gaffer, John Doe as Grip). When you click 'Add Crew Role', you create a unique profile for a person in that role. You can optionally assign this new role directly to a project. The `MID` (Member ID) is automatically generated to uniquely identify the person, even across different roles.",
    "manual_attendance_title": "5. Tracking Attendance: The Daily Log",
    "manual_attendance_desc": "The Attendance page is where you log daily shifts. The workflow is:",
    "manual_attendance_step1": "Select a Project from the first dropdown.",
    "manual_attendance_step2": "The DOP and Gaffer dropdowns will auto-fill based on the project settings, but you can change them.",
    "manual_attendance_step3": "Select a Crew Member Role from the second dropdown. This lists all roles assigned to the selected project.",
    "manual_attendance_step4": "Their attendance calendar will appear. Click 'Add Shift' to log a new entry for a specific date, filling in times, shift duration, and any notes.",
    "manual_attendance_step5": "Existing shifts can be viewed or edited by clicking on a marked date in the calendar.",
    "manual_payments_title": "6. Handling Payments",
    "manual_payments_desc": "On the Payments page, you can manage the financials for each project. Select a project to see a list of all crew members who have worked on it, along with their total earnings, paid amount, and outstanding balance. Use the action menu on each crew member's card to 'Update Payment' and log any new payments made to them.",
    "manual_reports_title": "7. Generating Reports",
    "manual_reports_desc_p1": "The Reports page provides powerful exporting capabilities.",
    "manual_reports_project_title": "Project-wise Report:",
    "manual_reports_project_desc": "Select a project to get a complete financial breakdown of every crew member who worked on it.",
    "manual_reports_crew_title": "Crew-wise Report:",
    "manual_reports_crew_desc": "Select a crew member to see a summary of their work across all projects, broken down by each role they performed.",
    "manual_reports_attendance_title": "Attendance Report:",
    "manual_reports_attendance_desc": "Get a monthly calendar-style breakdown of every shift for a specific project.",
    "manual_reports_desc_p2": "All reports can be exported to PDF, Excel, or Word for sharing and record-keeping.",
    "manual_app_lock_title": "8. Securing Your App: App Lock",
    "manual_app_lock_desc_p1": "You can add an extra layer of security to your app with a password lock.",
    "manual_app_lock_enable_title": "To Enable:",
    "manual_app_lock_enable_desc": "Go to Settings > Security and toggle the 'App Lock' switch to the 'on' position.",
    "manual_app_lock_use_title": "To Use:",
    "manual_app_lock_use_desc": "After enabling, the next time you open the app, you will be required to enter your main account login password to access your data.",
    "manual_app_lock_forgot_title": "Forgot Password:",
    "manual_app_lock_forgot_desc": "If you forget your password, simply click the 'Forgot Password?' link on the lock screen to go through the standard password reset process.",

    "privacy_title": "Privacy Policy",
    "privacy_last_updated": "Last updated: July 28, 2024",
    "privacy_intro": "Light Crew ('we,' 'our,' or 'us') is committed to protecting your privacy. This Privacy Policy explains how we collect, use, disclose, and safeguard your information when you use our application. Please read this privacy policy carefully. If you do not agree with the terms of this privacy policy, please do not access the application.",
    "privacy_collection_title": "Collection of Your Information",
    "privacy_collection_intro": "We may collect information about you in a variety of ways. The information we may collect via the Application depends on the content and materials you use, and includes:",
    "privacy_collection_personal_title": "Personal Data:",
    "privacy_collection_personal_desc": "Personally identifiable information, such as your name, mobile number, and email address, that you voluntarily give to us when you register with the Application.",
    "privacy_collection_financial_title": "Financial Data:",
    "privacy_collection_financial_desc": "Data related to your payments and transactions, such as daily wages, payments made, and project financials, that you input into the application. This data is stored securely and is used solely for the functionality of the app.",
    "privacy_collection_firebase_title": "Data from Firebase:",
    "privacy_collection_firebase_desc": "We use Firebase for authentication and as our database. As such, Firebase may collect information as described in their own privacy policy. We specifically use Firebase Authentication for login and Firestore for data storage.",
    "privacy_use_title": "Use of Your Information",
    "privacy_use_intro": "Having accurate information about you permits us to provide you with a smooth, efficient, and customized experience. Specifically, we may use information collected about you via the Application to:",
    "privacy_use_item1": "Create and manage your account.",
    "privacy_use_item2": "Process your transactions and manage financial data for projects.",
    "privacy_use_item3": "Enable user-to-user communications within project contexts.",
    "privacy_use_item4": "Monitor and analyze usage and trends to improve your experience with the Application.",
    "privacy_use_item5": "Notify you of updates to the Application.",
    "privacy_use_item6": "Comply with legal obligations as required by Indian and U.S. law.",
    "privacy_disclosure_title": "Disclosure of Your Information",
    "privacy_disclosure_intro": "We do not share your information with third parties except in the situations described below or when you have given us your consent:",
    "privacy_disclosure_law_title": "By Law or to Protect Rights:",
    "privacy_disclosure_law_desc": "If we believe the release of information about you is necessary to respond to legal process, to investigate or remedy potential violations of our policies, or to protect the rights, property, and safety of others, we may share your information as permitted or required by any applicable law, rule, or regulation.",
    "privacy_disclosure_providers_title": "Third-Party Service Providers:",
    "privacy_disclosure_providers_desc": "We may share your information with third parties that perform services for us or on our behalf, including data analysis, hosting services (Firebase), and customer service.",
    "privacy_ads_title": "Advertising and Third-Party Data",
    "privacy_ads_desc": "Should we introduce advertising in the future, we may use third-party advertising companies to serve ads when you visit the Application. These companies may use information about your visits to the Application and other websites that are contained in web cookies to provide advertisements about goods and services of interest to you. We will update this policy and provide necessary controls if and when this feature is implemented.",
    "privacy_security_title": "Security of Your Information",
    "privacy_security_desc": "We use administrative, technical, and physical security measures to help protect your personal information. While we have taken reasonable steps to secure the personal information you provide to us, please be aware that despite our efforts, no security measures are perfect or impenetrable, and no method of data transmission can be guaranteed against any interception or other type of misuse.",
    "privacy_contact_desc": "If you have questions or comments about this Privacy Policy, please contact us at the email provided on our Contact Us page.",

    "terms_title": "Terms and Conditions",
    "terms_last_updated": "Last updated: July 28, 2024",
    "terms_intro": "Please read these Terms and Conditions ('Terms', 'Terms and Conditions') carefully before using the Light Crew application (the 'Service') operated by us. Your access to and use of the Service is conditioned on your acceptance of and compliance with these Terms. These Terms apply to all visitors, users, and others who access or use the Service.",
    "terms_accounts_title": "Accounts",
    "terms_accounts_desc": "When you create an account with us, you must provide us with information that is accurate, complete, and current at all times. Failure to do so constitutes a breach of the Terms, which may result in immediate termination of your account on our Service. You are responsible for safeguarding the password that you use to access the Service and for any activities or actions under your password.",
    "terms_content_title": "User-Generated Content",
    "terms_content_desc": "Our Service allows you to post, link, store, share and otherwise make available certain information, text, graphics, or other material ('Content'). You are responsible for the Content that you post to the Service, including its legality, reliability, and appropriateness. By posting Content to the Service, you grant us the right and license to use, modify, publicly perform, publicly display, reproduce, and distribute such Content on and through the Service for the purpose of operating and providing the Service.",
    "terms_ip_title": "Intellectual Property",
    "terms_ip_desc": "The Service and its original content (excluding Content provided by users), features, and functionality are and will remain the exclusive property of Light Crew and its licensors. The Service is protected by copyright, trademark, and other laws of both India and the United States.",
    "terms_liability_title": "Limitation Of Liability",
    "terms_liability_desc": "In no event shall Light Crew, nor its directors, employees, partners, agents, suppliers, or affiliates, be liable for any indirect, incidental, special, consequential or punitive damages, including without limitation, loss of profits, data, use, goodwill, or other intangible losses, resulting from (i) your access to or use of or inability to access or use the Service; (ii) any conduct or content of any third party on the Service; (iii) any content obtained from the Service; and (iv) unauthorized access, use or alteration of your transmissions or content, whether based on warranty, contract, tort (including negligence) or any other legal theory, whether or not we have been informed of the possibility of such damage, and even if a remedy set forth herein is found to have failed of its essential purpose.",
    "terms_law_title": "Governing Law",
    "terms_law_desc": "These Terms shall be governed and construed in accordance with the laws of India, without regard to its conflict of law provisions. For users in the United States, these terms will not deprive you of any mandatory protection you have under the law of the country where you live.",
    "terms_changes_title": "Changes",
    "terms_changes_desc": "We reserve the right, at our sole discretion, to modify or replace these Terms at any time. If a revision is material we will try to provide at least 30 days' notice prior to any new terms taking effect. What constitutes a material change will be determined at our sole discretion.",

    "project_deleted_title": "Project Deleted",
    "has_been_removed_desc": "has been removed.",
    "error_title": "Error",
    "could_not_delete_project_desc": "Could not delete the project. Please try again.",
    "view_button_text": "View",
    "edit_button_text": "Edit",
    "delete_button_text": "Delete",
    "are_you_sure_title": "Are you sure?",
    "delete_project_warning_desc": "This action cannot be undone. This will permanently delete the project",
    "loading_projects_text": "Loading Projects...",
    "no_projects_found_title": "No Projects Found",
    "add_project_to_start_text": "Add a new project to get started.",
    "crew_label": "Crew:",
    "assigned_suffix": "assigned",

    "profile_info_title": "Profile Information",
    "profile_info_desc": "Update your account's profile information.",
    "member_id_label": "Member ID",
    "loading_placeholder": "Loading...",
    "not_found_placeholder": "Not Found",
    "full_name_label": "Full Name",
    "mobile_number_label": "Mobile Number",
    "current_password_to_save_label": "Current Password (to save changes)",
    "save_profile_button_text": "Save Profile",
    "saving_button_text": "Saving...",
    "change_password_title": "Change Password",
    "change_password_desc": "Update your password. Make sure it's a strong one.",
    "current_password_label": "Current Password",
    "new_password_label": "New Password",
    "update_password_button_text": "Update Password",
    "updating_button_text": "Updating...",
    "profile_updated_success_title": "Profile Updated",
    "profile_updated_success_desc": "Your information has been saved.",
    "unexpected_error_desc": "An unexpected error occurred. Please try again.",
    "incorrect_password_desc": "Incorrect password. Please try again.",
    "too_many_requests_desc": "Too many requests. Please try again later.",
    "update_failed_title": "Update Failed",
    "password_changed_success_title": "Password Changed",
    "password_changed_success_desc": "Your password has been successfully updated.",
    "password_change_failed_title": "Password Change Failed",
    
    "welcome_prefix": "Welcome",
    "crew_member_fallback": "Crew Member",
    "personal_dashboard_description": "Here's a summary of your work and earnings.",
    "filter_data_placeholder": "Filter Data...",
    "monthly_filter": "Monthly",
    "yearly_filter": "Yearly",
    "project_wise_filter": "Project-wise",
    "select_month_placeholder": "Select Month",
    "select_year_placeholder": "Select Year",
    "select_project_placeholder": "Select Project",
    "total_earnings_label": "Total Earnings",
    "for_selected_period": "for selected period",
    "amount_paid_label": "Amount Paid",
    "of_total": "of total",
    "balance_label": "Balance",
    "to_be_paid": "to be paid",
    "total_shifts_label": "Total Shifts",
    "working_days_label": "Working Days",
    "unique_days_with_shifts": "unique days with shifts",
    "payment_status_title": "Payment Status",
    "payment_status_desc": "Paid vs. Balance overview.",
    "last_5_projects_earnings_title": "Last 5 Projects' Earnings",
    "last_5_projects_earnings_desc": "A look at your earnings from recent projects.",
    "loading_dashboard_text": "Loading your dashboard...",
    "no_crew_profile_linked": "No crew profile linked to this account.",
    "ensure_mobile_matches": "Ensure your profile's mobile number matches a crew profile.",
    "unknown_project_placeholder": "Unknown Project",
    "loading_chart_text": "Loading Chart...",
    "no_project_earnings_text": "No project earnings to display for this period.",
    "no_financial_data_period": "No financial data for this period."
}

      