
{
    "settings_title": "सेटिंग्स",
    "settings_description": "अपनी एप्लिकेशन सेटिंग्स, प्राथमिकताएं और खाता प्रबंधित करें।",
    "appearance_title": "दिखावट",
    "appearance_description": "दिखावट और अनुभव को अनुकूलित करें।",
    "theme_label": "थीम",
    "language_label": "भाषा",
    "security_title": "सुरक्षा",
    "security_description": "अतिरिक्त सुरक्षा सुविधाओं का प्रबंधन करें।",
    "app_lock_label": "ऐप लॉक",
    "app_lock_description": "ऐप लॉन्च पर पासवर्ड आवश्यक है।",
    "email_notifications_label": "ईमेल सूचनाएं",
    "email_notifications_description": "महत्वपूर्ण खाता अपडेट प्राप्त करें।",
    "data_sync_title": "डेटा और सिंक",
    "data_sync_description": "अपने स्थानीय एप्लिकेशन डेटा को प्रबंधित करें।",
    "manual_sync_button": "मैन्युअल सिंक",
    "delete_data_button": "सभी स्थानीय डेटा हटाएं",
    "delete_data_alert_title": "क्या आप बिल्कुल निश्चित हैं?",
    "delete_data_alert_description": "यह क्रिया पूर्ववत नहीं की जा सकती। यह आपके डिवाइस से सभी स्थानीय डेटा को स्थायी रूप से हटा देगा। सर्वर पर डेटा प्रभावित नहीं होगा।",
    "cancel": "रद्द करें",
    "delete_data_alert_confirm": "हाँ, सब कुछ हटा दें",
    "last_synced_label": "अंतिम सिंक:",
    "never": "कभी नहीँ",
    "language_updated": "भाषा अपडेट की गई",
    "language_switched_to": "भाषा में बदल गया",
    "app_lock_enabled_title": "ऐप लॉक सक्षम",
    "app_lock_enabled_desc": "अगले लॉन्च पर आपका पासवर्ड आवश्यक होगा।",
    "app_lock_disabled_title": "ऐप लॉक अक्षम",
    "app_lock_disabled_desc": "ऐप अब लॉक नहीं रहेगा।",
    "syncing_data_title": "डेटा सिंक हो रहा है...",
    "syncing_data_desc": "सर्वर के साथ सिंक करने के लिए बाध्य कर रहा है। कृपया प्रतीक्षा करें।",
    "sync_complete_title": "सिंक पूर्ण",
    "sync_complete_desc": "आपका स्थानीय डेटा अब अप-टू-डेट है।",
    "sync_failed_title": "सिंक विफल",
    "sync_failed_desc": "सिंक पूरा नहीं हो सका। कृपया अपना कनेक्शन जांचें।",
    "data_cleared_title": "स्थानीय डेटा साफ़ किया गया",
    "data_cleared_desc": "ऐप अब सर्वर से ताज़ा डेटा के साथ फिर से लोड होगा।",
    "data_clear_error_desc": "स्थानीय डेटा साफ़ नहीं किया जा सका। कृपया पुनः प्रयास करें।",

    "dashboard_title": "डैशबोर्ड",
    "projects_title": "परियोजनाएं",
    "projects_description": "अपनी फिल्म परियोजनाओं का प्रबंधन करें। नई परियोजनाएँ बनाएँ, या मौजूदा परियोजनाओं को देखने, संपादित करने या हटाने के लिए प्रत्येक कार्ड पर मेनू का उपयोग करें।",
    "attendance_title": "उपस्थिति",
    "team_title": "टीम",
    "reports_title": "रिपोर्ट",
    "profile_title": "प्रोफ़ाइल",
    "masters_title": "मास्टर्स",
    "payments_title": "भुगतान",
    "payments_description": "परियोजना के आधार पर क्रू भुगतान प्रबंधित करें।",
    "masters_description": "डीओपी, गैफर और पदनामों के लिए केंद्रीय सूचियों का प्रबंधन करें।",
    "attendance_description": "उनकी उपस्थिति कैलेंडर देखने के लिए एक परियोजना और क्रू सदस्य का चयन करें।",
    "team_description": "अपने क्रू सदस्यों को प्रबंधित करें। नए सदस्य जोड़ें, संपादित करें या उनकी प्रोफाइल देखें।",
    "profile_description": "अपनी व्यक्तिगत जानकारी और पासवर्ड प्रबंधित करें।",
    "reports_description": "विस्तृत परियोजना, क्रू और उपस्थिति रिपोर्ट बनाएं और निर्यात करें।",
    
    "about_title": "हमारे बारे में",
    "about_description": "फिल्म और प्रोडक्शन क्रू प्रबंधन के लिए अंतिम उपकरण।",
    "our_mission_title": "हमारा लक्ष्य",
    "our_mission_content": "लाइट क्रू में, हमारा मिशन फिल्म प्रोडक्शन प्रबंधन की जटिलताओं को सुव्यवस्थित करना है। हम मानते हैं कि एक शक्तिशाली, सहज और सुलभ मंच प्रदान करके, हम रचनाकारों, प्रबंधकों और क्रू सदस्यों को उस पर ध्यान केंद्रित करने के लिए सशक्त बना सकते हैं जो वे सबसे अच्छा करते हैं: अद्भुत दृश्य कहानियाँ बनाना। हमारा उद्देश्य प्रशासनिक बाधाओं को खत्म करना, संचार में सुधार करना और उत्पादन जीवनचक्र के हर चरण में पारदर्शिता लाना है।",
    "our_vision_title": "हमारी दृष्टि",
    "our_vision_content": "हम एक ऐसे भविष्य की कल्पना करते हैं जहां उत्पादन प्रबंधन अब तनाव का स्रोत नहीं है, बल्कि रचनात्मक प्रक्रिया का एक सहज हिस्सा है। लाइट क्रू उद्योग-मानक उपकरण होगा, जो अपनी विश्वसनीयता, ऑफ़लाइन-प्रथम क्षमताओं और उपयोगकर्ता-केंद्रित डिज़ाइन के लिए जाना जाता है। हम निरंतर नवाचार के लिए प्रतिबद्ध हैं, यह सुनिश्चित करते हुए कि हमारा मंच फिल्म और मीडिया उद्योग की गतिशील जरूरतों के साथ विकसित हो।",
    "key_features_title": "प्रमुख विशेषताऐं",
    "feature_pm_title": "परियोजना प्रबंधन",
    "feature_pm_desc": "एक ही डैशबोर्ड से अपनी सभी परियोजनाओं को सहजता से बनाएं, ट्रैक करें और प्रबंधित करें।",
    "feature_crew_title": "क्रू और उपस्थिति",
    "feature_crew_desc": "विस्तृत क्रू प्रोफाइल बनाए रखें और हमारे सहज कैलेंडर सिस्टम के साथ उपस्थिति को ट्रैक करें।",
    "feature_offline_title": "ऑफलाइन पहले",
    "feature_offline_desc": "इंटरनेट कनेक्शन के बिना भी, सेट पर आत्मविश्वास से काम करें। आपका डेटा स्वचालित रूप से सिंक हो जाता है।",

    "contact_title": "संपर्क करें",
    "contact_description": "हमें आपसे सुनना अच्छा लगेगा। किसी भी प्रश्न या प्रतिक्रिया के लिए संपर्क करें।",
    "get_in_touch_title": "संपर्क में रहें",
    "get_in_touch_desc": "हमारी टीम आपके किसी भी पूछताछ में आपकी सहायता के लिए उपलब्ध है।",
    "email_label": "ईमेल",
    "email_desc": "सामान्य पूछताछ, समर्थन और प्रतिक्रिया के लिए।",
    "address_label": "पता",
    "address_desc": "हमारे मुख्य कार्यालय का स्थान।",

    "manual_title": "उपयोगकर्ता पुस्तिका",
    "manual_description": "लाइट क्रू एप्लिकेशन का उपयोग करने के लिए एक पूरी गाइड।",
    "manual_getting_started_title": "शुरू हो जाओ",
    "manual_getting_started_desc": "लाइट क्रू में आपका स्वागत है! यह गाइड आपको एप्लिकेशन का अधिकतम लाभ उठाने के लिए आवश्यक सुविधाओं और वर्कफ़्लो के माध्यम से मार्गदर्शन करेगी।",
    "manual_dashboard_title": "1. डैशबोर्ड: आपका कमांड सेंटर",
    "manual_dashboard_desc": "लॉग इन करने के बाद डैशबोर्ड पहला पेज है जिसे आप देखते हैं। यह आपकी वित्तीय गतिविधि का एक व्यक्तिगत, एक-नज़र अवलोकन प्रदान करता है। आप अपनी कमाई, शिफ्ट और भुगतान की स्थिति को महीने, वर्ष या विशिष्ट परियोजनाओं के अनुसार फ़िल्टर कर सकते हैं। यहीं पर आप किसी भी अवधि के लिए अपनी कुल कमाई, भुगतान की गई राशि और बकाया शेष राशि को ट्रैक कर सकते हैं।",
    "manual_masters_title": "2. मास्टर्स का प्रबंधन: नींव",
    "manual_masters_desc_p1": "इससे पहले कि आप परियोजनाओं को प्रभावी ढंग से प्रबंधित कर सकें, आपको अपनी मास्टर सूचियों को स्थापित करने की आवश्यकता है। साइडबार से मास्टर्स पेज पर नेविगेट करें। यहां आप कर सकते हैं:",
    "manual_masters_dop_gaffer_title": "डीओपी और गैफर्स जोड़ें:",
    "manual_masters_dop_gaffer_desc": "अपने मुख्य फ़ोटोग्राफ़ी निदेशकों और गैफ़र्स के लिए प्रोफ़ाइल बनाएँ।",
    "manual_masters_designations_title": "पदनाम प्रबंधित करें:",
    "manual_masters_designations_desc": "इस सूची में सभी संभावित क्रू भूमिकाएँ (जैसे, स्पार्क, ग्रिप, सहायक कैमरामैन) जोड़ें। इस सूची का उपयोग नई क्रू भूमिकाएँ जोड़ते समय किया जाएगा।",
    "manual_masters_desc_p2": "इन सूचियों को अद्यतन रखना एक सहज वर्कफ़्लो की कुंजी है।",
    "manual_projects_title": "3. परियोजनाएँ बनाना और प्रबंधित करना",
    "manual_projects_desc": "परियोजनाएँ पृष्ठ पर जाएँ। एक नई प्रविष्टि बनाने के लिए 'परियोजना जोड़ें' पर क्लिक करें। ग्राहक का नाम, तिथियाँ और स्थान जैसे विवरण भरें। यहाँ सबसे महत्वपूर्ण कदम अपने क्रू को सौंपना है। आप कई क्रू सदस्यों का चयन कर सकते हैं और इस परियोजना के लिए उनके विशिष्ट पदनाम और दैनिक वेतन को परिभाषित कर सकते हैं।",
    "manual_team_title": "4. टीम भूमिकाएँ जोड़ना और प्रबंधित करना",
    "manual_team_desc": "टीम पृष्ठ वह जगह है जहाँ आप व्यक्तिगत क्रू भूमिकाओं का प्रबंधन करते हैं। यह समझना महत्वपूर्ण है कि यहाँ प्रत्येक प्रविष्टि एक विशिष्ट भूमिका में एक व्यक्ति का प्रतिनिधित्व करती है। एक ही व्यक्ति की कई प्रविष्टियाँ हो सकती हैं यदि वे विभिन्न भूमिकाओं में काम करते हैं (उदाहरण के लिए, जॉन डो गैफर के रूप में, जॉन डो ग्रिप के रूप में)। जब आप 'क्रू भूमिका जोड़ें' पर क्लिक करते हैं, तो आप उस भूमिका में एक व्यक्ति के लिए एक अद्वितीय प्रोफ़ाइल बनाते हैं। आप इस नई भूमिका को वैकल्पिक रूप से सीधे एक परियोजना को सौंप सकते हैं। 'एमआईडी' (सदस्य आईडी) व्यक्ति को विशिष्ट रूप से पहचानने के लिए स्वचालित रूप से उत्पन्न होती है, भले ही विभिन्न भूमिकाओं में हो।",
    "manual_attendance_title": "5. उपस्थिति पर नज़र रखना: दैनिक लॉग",
    "manual_attendance_desc": "उपस्थिति पृष्ठ वह जगह है जहाँ आप दैनिक शिफ्ट लॉग करते हैं। वर्कफ़्लो है:",
    "manual_attendance_step1": "पहले ड्रॉपडाउन से एक परियोजना का चयन करें।",
    "manual_attendance_step2": "डीओपी और गैफर ड्रॉपडाउन परियोजना सेटिंग्स के आधार पर स्वतः भर जाएँगे, लेकिन आप उन्हें बदल सकते हैं।",
    "manual_attendance_step3": "दूसरे ड्रॉपडाउन से एक क्रू सदस्य भूमिका का चयन करें। यह चयनित परियोजना को सौंपी गई सभी भूमिकाओं को सूचीबद्ध करता है।",
    "manual_attendance_step4": "उनका उपस्थिति कैलेंडर दिखाई देगा। एक विशिष्ट तिथि के लिए एक नई प्रविष्टि लॉग करने के लिए 'शिफ्ट जोड़ें' पर क्लिक करें, समय, शिफ्ट अवधि और कोई भी नोट्स भरें।",
    "manual_attendance_step5": "कैलेंडर में एक चिह्नित तिथि पर क्लिक करके मौजूदा शिफ्ट देखी या संपादित की जा सकती हैं।",
    "manual_payments_title": "6. भुगतान संभालना",
    "manual_payments_desc": "भुगतान पृष्ठ पर, आप प्रत्येक परियोजना के लिए वित्तीय प्रबंधन कर सकते हैं। इस पर काम करने वाले सभी क्रू सदस्यों की सूची देखने के लिए एक परियोजना का चयन करें, साथ ही उनकी कुल कमाई, भुगतान की गई राशि और बकाया शेष राशि। प्रत्येक क्रू सदस्य के कार्ड पर 'भुगतान अपडेट करें' के लिए एक्शन मेनू का उपयोग करें और उन्हें किए गए किसी भी नए भुगतान को लॉग करें।",
    "manual_reports_title": "7. रिपोर्ट बनाना",
    "manual_reports_desc_p1": "रिपोर्ट पृष्ठ शक्तिशाली निर्यात क्षमताएं प्रदान करता है।",
    "manual_reports_project_title": "परियोजना-वार रिपोर्ट:",
    "manual_reports_project_desc": "इस पर काम करने वाले प्रत्येक क्रू सदस्य के पूर्ण वित्तीय विवरण प्राप्त करने के लिए एक परियोजना का चयन करें।",
    "manual_reports_crew_title": "क्रू-वार रिपोर्ट:",
    "manual_reports_crew_desc": "एक क्रू सदस्य का चयन करें ताकि उनके द्वारा की गई प्रत्येक भूमिका के अनुसार सभी परियोजनाओं में उनके काम का सारांश देख सकें।",
    "manual_reports_attendance_title": "उपस्थिति रिपोर्ट:",
    "manual_reports_attendance_desc": "एक विशिष्ट परियोजना के लिए हर शिफ्ट का मासिक कैलेंडर-शैली का विवरण प्राप्त करें।",
    "manual_reports_desc_p2": "साझा करने और रिकॉर्ड रखने के लिए सभी रिपोर्ट पीडीएफ, एक्सेल या वर्ड में निर्यात की जा सकती हैं।",
    "manual_app_lock_title": "8. अपने ऐप को सुरक्षित करना: ऐप लॉक",
    "manual_app_lock_desc_p1": "आप एक पासवर्ड लॉक के साथ अपने ऐप में सुरक्षा की एक अतिरिक्त परत जोड़ सकते हैं।",
    "manual_app_lock_enable_title": "सक्षम करने के लिए:",
    "manual_app_lock_enable_desc": "सेटिंग्स > सुरक्षा पर जाएं और 'ऐप लॉक' स्विच को 'चालू' स्थिति में टॉगल करें।",
    "manual_app_lock_use_title": "उपयोग करने के लिए:",
    "manual_app_lock_use_desc": "सक्षम करने के बाद, अगली बार जब आप ऐप खोलेंगे, तो आपको अपने डेटा तक पहुंचने के लिए अपना मुख्य खाता लॉगिन पासवर्ड दर्ज करना होगा।",
    "manual_app_lock_forgot_title": "पासवर्ड भूल गए:",
    "manual_app_lock_forgot_desc": "यदि आप अपना पासवर्ड भूल जाते हैं, तो मानक पासवर्ड रीसेट प्रक्रिया से गुजरने के लिए लॉक स्क्रीन पर 'पासवर्ड भूल गए?' लिंक पर क्लिक करें।",

    "privacy_title": "गोपनीयता नीति",
    "privacy_last_updated": "अंतिम अपडेट: 28 जुलाई, 2024",
    "privacy_intro": "लाइट क्रू ('हम,' 'हमारा,' या 'हमें') आपकी गोपनीयता की रक्षा के लिए प्रतिबद्ध है। यह गोपनीयता नीति बताती है कि जब आप हमारे एप्लिकेशन का उपयोग करते हैं तो हम आपकी जानकारी कैसे एकत्र, उपयोग, खुलासा और सुरक्षित करते हैं। कृपया इस गोपनीयता नीति को ध्यान से पढ़ें। यदि आप इस गोपनीयता नीति की शर्तों से सहमत नहीं हैं, तो कृपया एप्लिकेशन तक न पहुंचें।",
    "privacy_collection_title": "आपकी जानकारी का संग्रह",
    "privacy_collection_intro": "हम आपके बारे में कई तरह से जानकारी एकत्र कर सकते हैं। एप्लिकेशन के माध्यम से हम जो जानकारी एकत्र कर सकते हैं, वह आपके द्वारा उपयोग की जाने वाली सामग्री और सामग्रियों पर निर्भर करती है, और इसमें शामिल हैं:",
    "privacy_collection_personal_title": "व्यक्तिगत डेटा:",
    "privacy_collection_personal_desc": "व्यक्तिगत रूप से पहचानी जाने वाली जानकारी, जैसे आपका नाम, मोबाइल नंबर और ईमेल पता, जो आप हमें एप्लिकेशन के साथ पंजीकरण करते समय स्वेच्छा से देते हैं।",
    "privacy_collection_financial_title": "वित्तीय डेटा:",
    "privacy_collection_financial_desc": "आपके भुगतानों और लेनदेन से संबंधित डेटा, जैसे दैनिक मजदूरी, किए गए भुगतान और परियोजना वित्तीय, जो आप एप्लिकेशन में इनपुट करते हैं। यह डेटा सुरक्षित रूप से संग्रहीत किया जाता है और केवल ऐप की कार्यक्षमता के लिए उपयोग किया जाता है।",
    "privacy_collection_firebase_title": "फायरबेस से डेटा:",
    "privacy_collection_firebase_desc": "हम प्रमाणीकरण और हमारे डेटाबेस के रूप में फायरबेस का उपयोग करते हैं। इस तरह, फायरबेस अपनी गोपनीयता नीति में वर्णित अनुसार जानकारी एकत्र कर सकता है। हम विशेष रूप से लॉगिन के लिए फायरबेस प्रमाणीकरण और डेटा भंडारण के लिए फायरस्टोर का उपयोग करते हैं।",
    "privacy_use_title": "आपकी जानकारी का उपयोग",
    "privacy_use_intro": "आपके बारे में सटीक जानकारी होने से हमें आपको एक सहज, कुशल और अनुकूलित अनुभव प्रदान करने की अनुमति मिलती है। विशेष रूप से, हम आपके बारे में एप्लिकेशन के माध्यम से एकत्र की गई जानकारी का उपयोग कर सकते हैं:",
    "privacy_use_item1": "आपका खाता बनाएं और प्रबंधित करें।",
    "privacy_use_item2": "अपने लेनदेन को संसाधित करें और परियोजनाओं के लिए वित्तीय डेटा प्रबंधित करें।",
    "privacy_use_item3": "परियोजना संदर्भों के भीतर उपयोगकर्ता-से-उपयोगकर्ता संचार सक्षम करें।",
    "privacy_use_item4": "एप्लिकेशन के साथ अपने अनुभव को बेहतर बनाने के लिए उपयोग और रुझानों की निगरानी और विश्लेषण करें।",
    "privacy_use_item5": "आपको एप्लिकेशन के अपडेट के बारे में सूचित करें।",
    "privacy_use_item6": "भारतीय और अमेरिकी कानून द्वारा आवश्यक कानूनी दायित्वों का पालन करें।",
    "privacy_disclosure_title": "आपकी जानकारी का खुलासा",
    "privacy_disclosure_intro": "हम आपकी जानकारी को तीसरे पक्ष के साथ साझा नहीं करते हैं, सिवाय नीचे वर्णित स्थितियों में या जब आपने हमें अपनी सहमति दी हो:",
    "privacy_disclosure_law_title": "कानून द्वारा या अधिकारों की रक्षा के लिए:",
    "privacy_disclosure_law_desc": "यदि हम मानते हैं कि आपके बारे में जानकारी जारी करना कानूनी प्रक्रिया का जवाब देने, हमारी नीतियों के संभावित उल्लंघनों की जांच या उपचार करने, या दूसरों के अधिकारों, संपत्ति और सुरक्षा की रक्षा करने के लिए आवश्यक है, तो हम आपकी जानकारी को किसी भी लागू कानून, नियम या विनियमन द्वारा अनुमत या आवश्यक रूप से साझा कर सकते हैं।",
    "privacy_disclosure_providers_title": "तृतीय-पक्ष सेवा प्रदाता:",
    "privacy_disclosure_providers_desc": "हम आपकी जानकारी को उन तीसरे पक्षों के साथ साझा कर सकते हैं जो हमारे लिए या हमारी ओर से सेवाएं प्रदान करते हैं, जिसमें डेटा विश्लेषण, होस्टिंग सेवाएं (फायरबेस) और ग्राहक सेवा शामिल है।",
    "privacy_ads_title": "विज्ञापन और तृतीय-पक्ष डेटा",
    "privacy_ads_desc": "यदि हम भविष्य में विज्ञापन पेश करते हैं, तो हम एप्लिकेशन पर जाने पर विज्ञापन देने के लिए तृतीय-पक्ष विज्ञापन कंपनियों का उपयोग कर सकते हैं। ये कंपनियाँ आपकी रुचि के सामान और सेवाओं के बारे में विज्ञापन प्रदान करने के लिए वेब कुकीज़ में निहित एप्लिकेशन और अन्य वेबसाइटों पर आपकी यात्राओं के बारे में जानकारी का उपयोग कर सकती हैं। हम इस नीति को अपडेट करेंगे और यदि और जब यह सुविधा लागू की जाती है तो आवश्यक नियंत्रण प्रदान करेंगे।",
    "privacy_security_title": "आपकी जानकारी की सुरक्षा",
    "privacy_security_desc": "हम आपकी व्यक्तिगत जानकारी की सुरक्षा में मदद करने के लिए प्रशासनिक, तकनीकी और भौतिक सुरक्षा उपायों का उपयोग करते हैं। जबकि हमने आपके द्वारा हमें प्रदान की गई व्यक्तिगत जानकारी को सुरक्षित करने के लिए उचित कदम उठाए हैं, कृपया ध्यान रखें कि हमारे प्रयासों के बावजूद, कोई भी सुरक्षा उपाय सही या अभेद्य नहीं हैं, और डेटा ट्रांसमिशन की कोई भी विधि किसी भी अवरोधन या अन्य प्रकार के दुरुपयोग के खिलाफ गारंटी नहीं दी जा सकती है।",
    "privacy_contact_desc": "यदि आपके पास इस गोपनीयता नीति के बारे में कोई प्रश्न या टिप्पणी है, तो कृपया हमारे हमसे संपर्क करें पृष्ठ पर दिए गए ईमेल पर हमसे संपर्क करें।",

    "terms_title": "नियम और शर्तें",
    "terms_last_updated": "अंतिम अपडेट: 28 जुलाई, 2024",
    "terms_intro": "कृपया हमारे द्वारा संचालित लाइट क्रू एप्लिकेशन ('सेवा') का उपयोग करने से पहले इन नियमों और शर्तों ('शर्तें', 'नियम और शर्तें') को ध्यान से पढ़ें। सेवा तक आपकी पहुंच और उपयोग इन शर्तों की आपकी स्वीकृति और अनुपालन पर निर्भर करता है। ये शर्तें सभी आगंतुकों, उपयोगकर्ताओं और अन्य लोगों पर लागू होती हैं जो सेवा तक पहुंचते हैं या उसका उपयोग करते हैं।",
    "terms_accounts_title": "खाते",
    "terms_accounts_desc": "जब आप हमारे साथ एक खाता बनाते हैं, तो आपको हमें ऐसी जानकारी प्रदान करनी होगी जो हर समय सटीक, पूर्ण और वर्तमान हो। ऐसा करने में विफलता शर्तों का उल्लंघन है, जिसके परिणामस्वरूप हमारी सेवा पर आपका खाता तत्काल समाप्त हो सकता है। आप उस पासवर्ड की सुरक्षा के लिए जिम्मेदार हैं जिसका उपयोग आप सेवा तक पहुंचने के लिए करते हैं और अपने पासवर्ड के तहत किसी भी गतिविधि या कार्यों के लिए।",
    "terms_content_title": "उपयोगकर्ता-जनित सामग्री",
    "terms_content_desc": "हमारी सेवा आपको कुछ जानकारी, पाठ, ग्राफिक्स, या अन्य सामग्री ('सामग्री') पोस्ट करने, लिंक करने, संग्रहीत करने, साझा करने और अन्यथा उपलब्ध कराने की अनुमति देती है। आप उस सामग्री के लिए जिम्मेदार हैं जिसे आप सेवा पर पोस्ट करते हैं, जिसमें उसकी वैधता, विश्वसनीयता और उपयुक्तता शामिल है। सेवा पर सामग्री पोस्ट करके, आप हमें सेवा के संचालन और प्रदान करने के उद्देश्य से सेवा पर और उसके माध्यम से ऐसी सामग्री का उपयोग करने, संशोधित करने, सार्वजनिक रूप से प्रदर्शन करने, सार्वजनिक रूप से प्रदर्शित करने, पुन: पेश करने और वितरित करने का अधिकार और लाइसेंस प्रदान करते हैं।",
    "terms_ip_title": "बौद्धिक संपदा",
    "terms_ip_desc": "सेवा और इसकी मूल सामग्री (उपयोगकर्ताओं द्वारा प्रदान की गई सामग्री को छोड़कर), सुविधाएँ, और कार्यक्षमता लाइट क्रू और इसके लाइसेंसदाताओं की अनन्य संपत्ति है और रहेगी। सेवा भारत और संयुक्त राज्य अमेरिका दोनों के कॉपीराइट, ट्रेडमार्क और अन्य कानूनों द्वारा संरक्षित है।",
    "terms_liability_title": "देयता की सीमा",
    "terms_liability_desc": "किसी भी स्थिति में लाइट क्रू, न ही इसके निदेशक, कर्मचारी, भागीदार, एजेंट, आपूर्तिकर्ता, या सहयोगी, किसी भी अप्रत्यक्ष, आकस्मिक, विशेष, परिणामी या दंडात्मक क्षति के लिए उत्तरदायी नहीं होंगे, जिसमें बिना किसी सीमा के, लाभ, डेटा, उपयोग, सद्भावना, या अन्य अमूर्त नुकसानों का नुकसान शामिल है, जो (i) सेवा तक आपकी पहुंच या उपयोग या पहुंचने या उपयोग करने में असमर्थता; (ii) सेवा पर किसी तीसरे पक्ष के किसी भी आचरण या सामग्री; (iii) सेवा से प्राप्त कोई भी सामग्री; और (iv) आपके प्रसारण या सामग्री का अनधिकृत पहुंच, उपयोग या परिवर्तन, चाहे वारंटी, अनुबंध, टॉर्ट (लापरवाही सहित) या किसी अन्य कानूनी सिद्धांत पर आधारित हो, चाहे हमें इस तरह के नुकसान की संभावना के बारे में सूचित किया गया हो या नहीं, और भले ही यहां निर्धारित कोई उपाय अपने आवश्यक उद्देश्य में विफल पाया गया हो।",
    "terms_law_title": "शासकीय कानून",
    "terms_law_desc": "ये शर्तें भारत के कानूनों के अनुसार शासित और मानी जाएंगी, इसके कानून के प्रावधानों के टकराव की परवाह किए बिना। संयुक्त राज्य अमेरिका में उपयोगकर्ताओं के लिए, ये शर्तें आपको उस देश के कानून के तहत किसी भी अनिवार्य सुरक्षा से वंचित नहीं करेंगी जहां आप रहते हैं।",
    "terms_changes_title": "परिवर्तन",
    "terms_changes_desc": "हम अपने एकमात्र विवेक पर, किसी भी समय इन शर्तों को संशोधित करने या बदलने का अधिकार सुरक्षित रखते हैं। यदि कोई संशोधन महत्वपूर्ण है तो हम किसी भी नई शर्तों के प्रभावी होने से कम से-कम 30 दिन पहले नोटिस प्रदान करने का प्रयास करेंगे। एक महत्वपूर्ण परिवर्तन क्या है यह हमारे एकमात्र विवेक पर निर्धारित किया जाएगा।",
    "project_deleted_title": "परियोजना हटाई गई",
    "has_been_removed_desc": "को हटा दिया गया है।",
    "error_title": "त्रुटि",
    "could_not_delete_project_desc": "परियोजना को हटाया नहीं जा सका। कृपया पुनः प्रयास करें।",
    "view_button_text": "देखें",
    "edit_button_text": "संपादित करें",
    "delete_button_text": "हटाएं",
    "are_you_sure_title": "क्या आप निश्चित हैं?",
    "delete_project_warning_desc": "यह क्रिया पूर्ववत नहीं की जा सकती। यह परियोजना को स्थायी रूप से हटा देगा",
    "loading_projects_text": "परियोजनाएं लोड हो रही हैं...",
    "no_projects_found_title": "कोई परियोजना नहीं मिली",
    "add_project_to_start_text": "शुरू करने के लिए एक नई परियोजना जोड़ें।",
    "crew_label": "क्रू:",
    "assigned_suffix": "सौंपा गया",

    "profile_info_title": "प्रोफ़ाइल जानकारी",
    "profile_info_desc": "अपने खाते की प्रोफ़ाइल जानकारी अपडेट करें।",
    "member_id_label": "सदस्य आईडी",
    "loading_placeholder": "लोड हो रहा है...",
    "not_found_placeholder": "नहीं मिला",
    "full_name_label": "पूरा नाम",
    "mobile_number_label": "मोबाइल नंबर",
    "current_password_to_save_label": "वर्तमान पासवर्ड (बदलाव सहेजने के लिए)",
    "save_profile_button_text": "प्रोफ़ाइल सहेजें",
    "saving_button_text": "सहेज रहा है...",
    "change_password_title": "पासवर्ड बदलें",
    "change_password_desc": "अपना पासवर्ड अपडेट करें। सुनिश्चित करें कि यह एक मजबूत पासवर्ड है।",
    "current_password_label": "वर्तमान पासवर्ड",
    "new_password_label": "नया पासवर्ड",
    "update_password_button_text": "पासवर्ड अपडेट करें",
    "updating_button_text": "अपडेट हो रहा है...",
    "profile_updated_success_title": "प्रोफ़ाइल अपडेट की गई",
    "profile_updated_success_desc": "आपकी जानकारी सहेज ली गई है।",
    "unexpected_error_desc": "एक अप्रत्याशित त्रुटि हुई। कृपया पुनः प्रयास करें।",
    "incorrect_password_desc": "गलत पासवर्ड। कृपया पुनः प्रयास करें।",
    "too_many_requests_desc": "बहुत अधिक अनुरोध। कृपया बाद में पुनः प्रयास करें।",
    "update_failed_title": "अपडेट विफल",
    "password_changed_success_title": "पासवर्ड बदल गया",
    "password_changed_success_desc": "आपका पासवर्ड सफलतापूर्वक अपडेट कर दिया गया है।",
    "password_change_failed_title": "पासवर्ड बदलने में विफल",
    
    "welcome_prefix": "स्वागत है",
    "crew_member_fallback": "क्रू सदस्य",
    "personal_dashboard_description": "यहां आपके काम और कमाई का सारांश है।",
    "filter_data_placeholder": "डेटा फ़िल्टर करें...",
    "monthly_filter": "मासिक",
    "yearly_filter": "वार्षिक",
    "project_wise_filter": "परियोजना-वार",
    "select_month_placeholder": "माह चुनें",
    "select_year_placeholder": "वर्ष चुनें",
    "select_project_placeholder": "परियोजना चुनें",
    "total_earnings_label": "कुल कमाई",
    "for_selected_period": "चयनित अवधि के लिए",
    "amount_paid_label": "भुगतान की गई राशि",
    "of_total": "कुल का",
    "balance_label": "शेष",
    "to_be_paid": "भुगतान किया जाना है",
    "total_shifts_label": "कुल शिफ्ट",
    "working_days_label": "कार्य दिवस",
    "unique_days_with_shifts": "शिफ्ट के साथ अद्वितीय दिन",
    "payment_status_title": "भुगतान की स्थिति",
    "payment_status_desc": "भुगतान बनाम शेष अवलोकन।",
    "last_5_projects_earnings_title": "अंतिम 5 परियोजनाओं की कमाई",
    "last_5_projects_earnings_desc": "हाल की परियोजनाओं से आपकी कमाई पर एक नज़र।",
    "loading_dashboard_text": "आपका डैशबोर्ड लोड हो रहा है...",
    "no_crew_profile_linked": "इस खाते से कोई क्रू प्रोफ़ाइल लिंक नहीं है।",
    "ensure_mobile_matches": "सुनिश्चित करें कि आपकी प्रोफ़ाइल का मोबाइल नंबर एक क्रू प्रोफ़ाइल से मेल खाता है।",
    "unknown_project_placeholder": "अज्ञात परियोजना",
    "loading_chart_text": "चार्ट लोड हो रहा है...",
    "no_project_earnings_text": "इस अवधि के लिए प्रदर्शित करने के लिए कोई परियोजना आय नहीं है।",
    "no_financial_data_period": "इस अवधि के लिए कोई वित्तीय डेटा नहीं है।"
}

      